Revit 2015 API
CurtainSystemTypeSet Class
A set that contains CurtainSystem types.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Syntax
C#
public class CurtainSystemTypeSet : APIObject,
	IEnumerable
Visual Basic
Public Class CurtainSystemTypeSet _
	Inherits APIObject _
	Implements IEnumerable
Visual C++
public ref class CurtainSystemTypeSet : public APIObject,
	IEnumerable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.CurtainSystemTypeSet
See Also
CurtainSystemTypeSet Members
Autodesk.Revit.DB Namespace